Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: An Apple event record is a descriptor whose data is a set of descriptors keyed by four-character codes.
ja: アップルイベントレコードは、それのデータが４文字コードによってキー付けされる記述子の一揃いである記述子です。

source: An HFS file type code.
ja: HFSファイルタイプコード。

source: An NSHashEnumerator structure that will cause successive elements of table to be returned each time this enumerator is passed to NSNext Hash Enumerator Item.
ja: あるNSHashEnumerator構造体で、それはtableの連続する要素に、この列挙子がNSNext Hash Enumerator Itemに渡されるたびごとに返されるようにします。

source: An NSURL or NSString object containing the URL that set this cookie.
ja: NSURLまたはNSStringオブジェクト、このクッキーを設定するURLを含んでいます。

source: An Objective-C method is simply a C function that take at least two arguments—self and _cmd.
ja: Objective-Cメソッドは、単純にC関数です、それは少なくとも２つの引数を取ります—selfと_cmd。

source: An XML document as internalized into a logical tree structure.
ja: 論理ツリー構造へ内面化されるとおりのXML文書。

source: An abbreviated date or time format.
ja: 省略された日付または時刻書式設定。

source: An abstract class representing a dimensional unit of measure.
ja: 計測の寸法単位を表すために使われる抽象クラス。

source: An abstract class representing a stream.
ja: あるストリームを表している抽象クラス。

source: An abstract class representing a unit of measure.
ja: 寸法のいち単位を表している抽象クラス。

source: An abstract class that declares an interface for objects that create, interpret, and validate the textual representation of values.
ja: 値のテキスト表現を作成、解釈、そして確認するオブジェクトへのインターフェイスを宣言する抽象クラス。

source: An abstract class that provides the basis for testing specifiers one at a time or in groups.
ja: １度に１つ、またはグループで指定子をテストするための基盤を提供する抽象クラス。

source: An abstract class that provides the interface for querying the relationships and properties of a class.
ja: あるクラスのリレーションシップ（関係）とプロパティについて問い合わせるためのインターフェイスを提供するある抽象クラス。

source: An abstract class that represents a communication channel.
ja: 通信経路を表す抽象クラス。

source: An abstract class that represents the code and data associated with a single task.
ja: ある単一のタスクと結びつけられたコードとデータを表す抽象クラス。

source: An abstract class that serves as the basis for objects that enable archiving and distribution of other objects.
ja: 他のオブジェクトのアーカイブと配布を可能にするオブジェクトの基礎として奉仕する抽象クラス。

source: An abstract class used to represent natural language expressions.
ja: 自然言語表現を表すために使われる抽象クラス。

source: An abstract class whose subclasses enumerate collections of objects, such as arrays and dictionaries.
ja: ある抽象クラス、それのサブクラスはオブジェクトのコレクション、例えば配列や辞書などを列挙します。

source: An abstract superclass of a class cluster that scans values from a string.
ja: あるクラスクラスタの抽象スーパークラスで、それはある文字列からの値をスキャンします。

source: An affine transformation is a special type of transformation that preserves parallel lines in a path but does not necessarily preserve lengths or angles.
ja: アフィン変換は、変換の特別な種類です、それはあるパスにおける平行線を保ちます、しかし必ずしも長さや角度を保ちません。

source: An alias for a type that specifies possible calculation errors.
ja: 起こりうる計算エラーを指定する型のためのエイリアス。

source: An alias for an enumeration that specifies possible rounding modes.
ja: 可能な丸めモードを指定する列挙のためのエイリアス。

source: An alias for the type of an index.
ja: あるインデックスの型に対するエイリアス。

source: An alias for the type that an index set holds.
ja: インデックス集合を保持する型に対するエイリアス

source: An alias for this value type's equivalent reference type.
ja: この値型の持つ同等参照型に対するエイリアス。

source: An application can use NSHTTPCookie method request Header Fields(with:) to turn this array into a set of header fields to add to an NSMutable URLRequest object.
ja: アプリケーションは、NSHTTPCookieのメソッドrequest Header Fields(with:)を使って、この配列を一揃いのヘッダフィールドに転換して、NSMutable URLRequestオブジェクトに加えます。

source: An array containing NSString objects representing the era symbols for the receiver (for example, {“B.C.E.”, “C.E.”}).
ja: レシーバに対する紀元シンボルを表しているNSStringオブジェクトを含んでいる配列（例えば、{“B.C.E.”, “C.E.”} ）。

source: An array containing NSString objects representing the era symbols for the receiver (for example, {“Before Common Era”, “Common Era”}).
ja: レシーバに対する紀元シンボルを表しているNSStringオブジェクトを含んでいる配列（例えば、{“Before Common Era”, “Common Era”} ）。

source: An array containing the contents of the file specified by a Path.
ja: a Pathによって指定されるファイルの内容を含んでいる配列。

source: An array containing the contents specified by a URL.
ja: a URLによって指定される内容を含んでいる配列。

source: An array containing the full pathnames for all bundle resources matching the specified criteria.
ja: 指定された基準に合致する全てのバンドルリソースに対する完全パス名を含んでいる配列。

source: An array containing the keys for the to-many relationship properties of the receiver.
ja: レシーバの対多関係プロパティに対するキーを格納している配列。

source: An array containing the objects in the argument list.
ja: 引数リストの中のオブジェクトを含んでいる１つの配列。

source: An array containing the objects in the array at the indexes specified by indexes.
ja: indexesによって指定されるインデックスでの、この配列の中のオブジェクトを含んでいる配列。

source: An array containing the objects with which to initialize the new array.
ja: それで新しい配列を初期化するところの幾らかのオブジェクトを含んでいる配列。

source: An array containing the single element an Object.
ja: ただ１つの要素an Objectを含んでいる配列。

source: An array containing the top-level objects in the nib file.
ja: nibファイルの中のトップレベルオブジェクトを含んでいる配列。

source: An array containing the transformed elements of this sequence.
ja: このシーケンスの変換済み要素を含んでいる配列。

source: An array initialized to contain the contents of the file specified by a Path or nil if the file can’t be opened or the contents of the file can’t be parsed into an array.
ja: a Path or nilによって指定されるファイルの内容を含むように初期化される配列、またはそのファイルが開かれることができないまたはファイルの内容が配列へと構文解析されることができないならばnil。

source: An array initialized to contain the contents specified by a URL.
ja: a URLによって指定される内容を含むように初期化される配列。

source: An array initialized to contain the objects in an Array.
ja: an Arrayの中のオブジェクトを含めることで初期化されるある配列。

source: An array initialized to contain the objects in `anArray``.
ja: `anArray``の中のオブジェクトを含めることで初期化されるある配列。

source: An array initialized to include the objects in the argument list.
ja: 引数リストの中のオブジェクトを含むように初期化される配列。

source: An array object containing all the elements of table.
ja: tableの要素すべてを含んでいる配列オブジェクト。

source: An array object containing all the keys in table.
ja: tableの中の全てのキーを含んでいる配列オブジェクト。

source: An array object containing all the values in table.
ja: tableの中の全ての値を含んでいる配列オブジェクト。

source: An array of NSString objects containing language IDs for localizations in the bundle.
ja: バンドルの中のローカライゼーションに対するIDを含んでいるNSStringオブジェクトからなる配列。

source: An array of NSText Checking Result objects.
ja: NSText Checking Resultオブジェクトの配列。

source: An array of NSSort Descriptor objects.
ja: NSSort Descriptorオブジェクトの配列。

source: An array of NSString objects containing the names of immutable values that instances of the receiver's class contain.
ja: NSStringオブジェクトの配列、不変の値の名前を格納していて、それはレシーバのクラスのインスタンスを含みます。

source: An array of NSString objects identifying the directories and files (including symbolic links) contained in path.
ja: pathに含まれるディレクトリとファイル（シンボリックリンクを含む）を識別しているNSStringオブジェクトからなる配列。

source: An array of NSString objects representing the user-visible (for the Finder, Open and Save panels, and so on) components of path.
ja: ユーザが（Finderでは、「開く」や「保存」パネル、その他で）見ることができるpathの構成要素を表しているNSStringオブジェクトからなる配列。

source: An array of NSString objects, each of which contains the path of an item in the directory specified by path.
ja: NSStringオブジェクトの配列、そのそれぞれがpathによって指定されるディレクトリの中のある項目のパスを含んでいます。

source: An array of NSString objects, each of which identifies a file, directory, or symbolic link contained in path.
ja: NSStringオブジェクトの配列、そのそれぞれはpathに含まれるファイル、ディレクトリ、またはシンボリックリンクを識別します。

source: An array of NSURL objects identifying the mounted volumes.
ja: マウントされたボリュームを識別するNSURLオブジェクトからなる配列。

source: An array of NSURL objects identifying the requested directories.
ja: 要請されたディレクトリそれらを識別している、NSURLオブジェクトからなる配列。

source: An array of NSURL objects, each of which identifies a file, directory, or symbolic link contained in url.
ja: NSURLオブジェクトの配列、そのそれぞれはurlに含まれるファイル、ディレクトリ、またはシンボリックリンクを識別します。

source: An array of BCP 47 language codes corresponding to a user's preferred languages.
ja: BCP 47言語コードの配列は、ユーザの環境設定言語に相当します。

source: An array of all of the application’s bundles that represent frameworks.
ja: アプリケーションの持つバンドルで、フレームワークを表すもの全てからなる配列。

source: An array of bytes to copy.
ja: コピーすることになる、バイトの配列。

source: An array of cookies whose URL matches the provided URL.
ja: 提供されたURLとそれのURLが合致するクッキーからなる配列。

source: An array of custom actions to display along with the built-in actions.
ja: 表示するあつらえのアクション、それに加えて組込みアクションからなる配列。

source: An array of file URLs for the resource files matching the criteria or an empty array if no files could be located.
ja: 基準に合致しているリソースファイルに対するファイルURLからなる配列、またはファイルが捜し出されることができなかったならば空の配列。

source: An array of file URLs for the resource files or nil if no files could be located at subpath with extension.
ja: リソースファイルに対するファイルURLからなる配列、またはnil、もしファイルがsubpathでextensionを使って捜し出されることができないならば。

source: An array of identifiers, each corresponding to a localization that a bundle can support.
ja: いくつかの識別子からなる配列、それぞれがバンドルがサポートできるローカライゼーションの１つに相当します。

source: An array of keys that identify the file properties that you want pre-fetched for each item in the directory.
ja: そのディレクトリにおいて各項目に対して事前読込みをあなたが望むファイルプロパティを識別するキーからなる配列。

source: An array of keys that identify the file properties that you want pre-fetched for each volume.
ja: あなたが各ボリュームに対して事前読込みされることを望むファイルプロパティを識別するキーからなる配列。

source: An array of locale identifiers, ordered according to user preference.
ja: ロケール識別子からなる配列、ユーザ環境設定に従って並べられます。

source: An array of numbers indicating the architecture types supported by the bundle’s executable.
ja: バンドルの持つ実行可能ファイルによってサポートされるアーキテクチャ型それぞれを指し示している数字からなる配列。

source: An array of strings that identifies the modes in which it is permissible to perform the specified selector.
ja: 文字列からなる配列、それは指定されたセレクタの実行が許可されるモードを識別します。

source: An array of strings that identify the modes to associate with the timer that performs the selector.
ja: 文字列からなる配列、それはモードを識別してセレクタを実行するタイマーと結びつけます。

source: An array of strings, each containing the path of an item in the directory specified by path.
ja: それぞれがpathによって指定された辞書の中の項目のパスを含んでいる文字列からなる配列。

source: An array of subsequences, split from this collection’s elements.
ja: このコレクションの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of the accessibility elements in the container.
ja: コンテナの中のアクセシビリティ要素からなる配列。

source: An array of the elements that is Included allowed.
ja: is Includedが許可する要素からなる配列。

source: An array of the non-nil results of calling transform with each element of the sequence.
ja: シーケンスの各要素でtransformを呼ぶことの非nilの結果の配列。

source: An array that lists the receiving array’s elements in ascending order, as determined by the comparison method specified cmptr.
ja: 新しい配列、それは、受け手側の配列の持つ要素を昇順で、cmptrで指定される比較メソッドによって決定されるとおりに列記するものです。

source: An array that lists the receiving array’s elements in ascending order, as determined by the comparison method specified by the selector comparator.
ja: 新しい配列、それは、受け手側の配列の持つ要素を昇順で、セレクタcomparatorによって指定される比較メソッドで決定されるとおりに列記するものです。

source: An array.
ja: １つの配列。

source: An association of characters and their attributes is called an attributed string.
ja: 文字とそれらの属性の結合したものは、属性付文字と呼ばれます。

source: An attributed string that represents an Object.
ja: an Objectを表す属性付き文字列。

source: An attributed string.
ja: 属性付き文字列。

source: An element of the transform matrix that contributes scaling, rotation, and shear.
ja: 拡大縮小、回転、そして剪断を与える変換マトリックスのある要素。

source: An element of the transform matrix that contributes translation.
ja: 平行移動を与える変換マトリックスのある要素。

source: An element to search for in the collection.
ja: このコレクションにおいて捜される要素。

source: An empty list descriptor, or nil if an error occurs.
ja: 空のリスト記述子、またはエラーが起こるならばnil。

source: An encapsulation of calendar information and calculations that bridges to Calendar; use NSCalendar when you need reference semantics or other Foundation-specific behavior.
ja: カレンダーの情報といくつかの計算のカプセル化で、それはCalendarへブリッジを行います；あなたが参照意味論や他のFoundation特有の挙動を必要とする場合はNSCalendarを使ってください。

source: An enumeration does not resolve symbolic links, or attempt to traverse symbolic links that point to directories.
ja: 列挙は、シンボリックリンクを解決しません、またはディレクトリを指すシンボリックリンクを辿ることを試みません。

source: An enumeration for the various components of a calendar date.
ja: あるカレンダー日付の様々な構成要素に対する列挙。

source: An enumeration is recursive, including the files of all subdirectories, and crosses device boundaries.
ja: 列挙は再帰的で、すべての下位ディレクトリのファイルを含んでいます、そしてデバイス境界を越えていきます。

source: An enumerator object that lets you access each object in the array, in order, from the element at the highest index down to the element at index 0.
ja: あなたに配列の中の各オブジェクトに、最も高いインデックスでの要素からインデックス0での要素へと低い方に順番にアクセスをさせる、列挙子オブジェクト。

source: An enumerator object that lets you access each object in the array, in order, from the element at the lowest index upwards.
ja: あなたに配列の中の各オブジェクトに、最も低いインデックスでの要素から高い方へと順番にアクセスをさせる、列挙子オブジェクト。

source: An era or count of eras.
ja: ある紀年または数え紀年。

source: An error is generated if instances of the receiver can’t respond to a Selector messages.
ja: レシーバのインスタンスがa Selectorメッセージに応答出来ないならばエラーが生成されます。

source: An event driven parser of XML documents (including DTD declarations).
ja: XML文書（DTD宣言を含む）のイベント駆動パーサ。

source: An exception is the week-in-month calculation, which returns 0 for days before the first week in the month containing the date.
ja: １つの例外は、月の中の週の計算です、それは、日付を含んでいる月の最初の週の前のいく日かに対して０を返します。

source: An exception is thrown if tag does not exist in your app.
ja: tagがあなたのアプリの中に存在しないならば、例外がスローされます。

source: An exception is thrown if any of the tags in the set do not exist in your app.
ja: その一揃いの中のtagのどれもあなたのアプリの中に存在しないならば、例外がスローされます。

source: An exception will be generated if you attempt to access a result with an index value exceeding number Of Capture Groups-1.
ja: あなたがnumber Of Capture Groups-1を上回るインデックス値で、ある結果にアクセスしようとするならば、例外が発生します。

source: An existing file is not overwritten
ja: 既存のファイルは、上書きされません

source: An expression for use in a comparison predicate.
ja: 比較述部において使うための式。

source: An hour or count of hours.
ja: ある時間または数え時間。

source: An iCloud-based container of key-value pairs you use to share data among instances of your app running on a user's connected devices.
ja: キー値ペアのiCloud基盤のコンテナ、あなたがユーザの持つ接続済みデバイス上で動作しているあなたのアプリのインスタンス間でデータを共有するために使います。

source: An identity affine transformation matrix
ja: 恒等アフィン変換マトリックス

source: An immutable collection of values representing different aspects of an item for an extension to act upon.
ja: 拡張がそれに作用するある項目の異なる面を表している値からなる不変コレクション。

source: An immutable description of how to order a collection of objects based on a property common to all the objects.
ja: 全てのオブジェクトに共通するプロパティに基づくオブジェクトからなるコレクションを並べる方法の不変の記述。

source: An immutable representation of a compiled regular expression that you apply to Unicode strings.
ja: 可変でない表現のコンパイル済み正規表現で、それをあなたはユニコード文字列に適用します。

source: An implementation of the forward Invocation: method has two tasks:
ja: forward Invocation:メソッドの実装には２つのやるべき仕事があります：

source: An index offset by n from the index i, unless that index would be beyond limit in the direction of movement.
ja: nだけインデックスiから補われたインデックス、そのインデックスがlimitを移動方向において越える場合を除きます。

source: An index offset by n from the index i.
ja: nだけインデックスiから補われるインデックス。

source: An index within the bounds of the array.
ja: この配列の境界内のインデックス。

source: An individual match is represented by an instance of the NSText Checking Result class, which carries information about the overall matched range (via its range property), and the range of each individual capture group (via the range(at:) method).
ja: 個々のマッチはNSText Checking Resultクラスのインスタンスによって表されます、そして、それはマッチされた全体の範囲に関する情報（そのrangeプロパティを通して）、そして個々の捕獲グループの範囲を（range(at:)メソッドによって）持ち運びます。

source: An informal protocol that objects adopt to be notified of changes to the specified properties of other objects.
ja: ある非形式プロトコル、それは、オブジェクトが採用して、他のオブジェクトの指定されたプロパティに対する変更の通知を受けるようになるものです。

source: An initialized HTTPURLResponse object or nil if an error occurred during initialization.
ja: 初期化されたHTTPURLResponseオブジェクト、または初期化の間にエラーが発生したならばnil。

source: An initialized NSInput Stream object for reading from data.
ja: dataから読み出すために初期化されたNSInput Streamオブジェクト。

source: An initialized NSInput Stream object that reads data from the file at path.
ja: 初期化されたNSInput Streamオブジェクト、それはpathでファイルからデータを読み出します。

source: An initialized NSInput Stream object that reads data from the file at url.
ja: 初期化されたNSInput Streamオブジェクト、それはurlでファイルからデータを読み出します。

source: An initialized file handle object.
ja: 初期化されたファイルハンドルオブジェクト。

source: An initialized object, or nil if an object could not be created for some reason that would not result in an exception.
ja: 初期化されたオブジェクト、または例外に終わらない何らかの理由でオブジェクトが作成されることができなかったならばnil。

source: An instance of NSApple Event Descriptor can represent any kind of descriptor, from a simple value descriptor, to a descriptor list, to a full-fledged Apple event.
ja: NSApple Event Descriptorのインスタンスはどんな種類の記述子でも、単純値記述子から、記述子リストまで、完全独立のアップルイベントまで表すことができます。

source: An instance of NSApple Event Descriptor represents a descriptor—the basic building block for Apple events.
ja: NSApple Event Descriptorのインスタンスは、ひとつの記述子 — アップルイベントのための基本的な建築ブロック — を表します。

source: An instance of NSApple Event Descriptor that is associated with the structure pointed to by ae Desc, or nil if an error occurs.
ja: NSApple Event Descriptorのインスタンス、それはae Descによって指し示される構造体と関連付けられます、またはエラーが起こるならばnil。

source: An instance of NSApple Event Descriptor with the specified type and data.
ja: 指定された型とデータを持つNSApple Event Descriptorのインスタンス。

source: An instance of NSClone Command clones the specified scriptable object or objects (such as words, paragraphs, images, and so on) and inserts them in the specified location, or the default location if no location is specified.
ja: NSClone Commandのインスタンスは、指定されたスクリプト対応のオブジェクトまたは複数のオブジェクトを複製（クローン）します（例えば、単語、段落、画像、などを）、そしてそれらを指定された場所に、または場所が指定されなければ省略時の場所に挿入します。

source: An instance of NSClose Command closes the specified scriptable object or objects—typically a document or window (and its associated document, if any).
ja: NSClose Commandのインスタンスは、指定されたスクリプト対応のオブジェクトまたは複数のオブジェクトを閉じます — 大抵はある文書またはウインドウ（およびそれの関連書類、もしあれば）。

source: An instance of NSCount Command counts the number of objects of a specified class in the specified object container (such as the number of words in a paragraph or document) and returns the result.
ja: NSCount Commandのインスタンスは、指定されたオブジェクトコンテナの中の指定されたクラスのオブジェクトの数を数えます（例えばある段落または文書の中の単語の数）、そして結果を返します。

source: An instance of NSCreate Command creates the specified scriptable object (such as a document), optionally supplying the new object with the specified attributes.
ja: NSCreate Commandのインスタンスは、指定されたスクリプト対応オブジェクト（例えば書類など）を作成して、随意に指定された属性を持つ新しいオブジェクトを提供します。

source: An instance of NSData containing the receiver’s data, or nil if an error occurs.
ja: レシーバの持つデータを含んでいるNSDataのインスタンス、またはエラーが起こるならばnil。

source: An instance of NSDelete Command deletes the specified scriptable object or objects (such as words, paragraphs, and so on).
ja: NSDelete Commandのインスタンスは、指定されたスクリプト対応オブジェクトまたは複数のオブジェクト（例えば単語、段落、など）を削除します。

source: An instance of NSExists Command determines whether a specified scriptable object, such as a word, paragraph, or image, exists.
ja: NSExists Commandのインスタンスは、ある指定されたスクリプト対応オブジェクト、例えば単語、段落、または画像などが存在するかどうかを判定します。

source: An instance of NSGet Command gets the specified value or object from the specified scriptable object: for example, the words from a paragraph or the name of a document.
ja: NSGet Commandのインスタンスは、指定されたスクリプト対応オブジェクトから指定された値またはオブジェクトを取得します：例えばある段落からの単語、またはある書類の名前。

source: An instance of NSMove Command moves the specified scriptable object or objects; for example, it may move words to a new location in a document or a file to a new directory.
ja: NSMove Commandのインスタンスは、指定されたスクリプト対応オブジェクトまたは複数のオブジェクトを移動します；例えば、それは幾らかの単語をある書類の中の新しい場所にまたはあるファイルをある新しいディレクトリへ移動します。

source: An instance of NSPointer Functions defines callout functions appropriate for managing a pointer reference held somewhere else.
ja: NSPointer Functionsのインスタンスは、どこか他の場所で保持されるポインタ参照を管理するためにコールアウト関数を定義します。

source: An instance of NSRegular Expression for the specified regular expression and options.
ja: 指定された正規表現とオプションのNSRegular Expressionインスタンス。

source: An instance of NSScript Command represents a scripting statement, such as set word 5 of the front document to word 1 of the second document, and contains the information needed to perform the operation specified by the statement.
ja: NSScript Commandのインスタンスは、ひとつのスクリプティング文を表します、例えばset word 5 of the front document to word 1 of the second documentなど、そしてその文によって指定される演算を実行するのに必要な情報を含みます。

source: An instance of NSSet Command sets one or more attributes or relationships to one or more values; for example, it may set the (x, y) coordinates for a window’s position or set the name of a document.
ja: NSSet Commandのインスタンスは、ひとつ以上の属性またはリレーションシップ（関係）をひとつ以上の値に設定します；例えば、それはウインドウ位置の座標 (x, y) を設定します、またある書類の名前を設定します。

source: An instance of an NSUser Script Task subclass or nil if the file does not appear to match any of the known types.
ja: NSUser Script Taskサブクラスのインスタンス、またはファイルが何らかの既知の型に合致するように見えないならばnil。

source: An integer value.
ja: ある整数値。

source: An interface that delegates of a stream instance use to handle events on the stream.
ja: ストリームインスタンスの委任先がストリーム上のイベントを処理するために使うインターフェイス。

source: An interface that enables the delegate of a metadata query to provide substitute results or attributes.
ja: メタデータ照会の委任先に代理の結果や属性の提供を可能にするインターフェイス。

source: An invocation of this method does not return until memory is flushed.
ja: このメソッドの発動は、メモリが一掃されるまで戻りません。

source: An item provider for conveying data or a file between processes during drag and drop or copy/paste activities, or from a host app to an app extension.
ja: ドラッグ＆ドロップまたはコピー／ペースト行為の間にプロセス間で、またはホストアプリからアプリ拡張へと、伝達しているデータやファイルのための項目提供者。

source: An iterator suitable for enumerating the elements of an index set.
ja: インデックス集合の要素を列挙するのに適切なイテレータ。

source: An iterator that operates over the contents of data.
ja: データの内容にわたって演算するイテレータ。

source: An object containing a list of indexes that bridges to Index Path; use NSIndex Path when you need reference semantics or other Foundation-specific behavior.
ja: インデックスからなるリストを含んでいるオブジェクト、それはIndex Pathにブリッジされます；NSIndex Pathをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合は使ってください。

source: An object containing information about the attributes and relationships of the receiver’s class.
ja: レシーバのクラスの属性とリレーションシップ（関係）についての情報を格納しているオブジェクト。

source: An object containing the date and time information to format.
ja: 書式設定することになる日付と時刻情報を含んでいるオブジェクト。

source: An object for representing and performing arithmetic on base-10 numbers that bridges to Decimal; use NSDecimal Number when you need reference semantics or other Foundation-specific behavior.
ja: 底10の数での計算を表すそして実行するためのオブジェクト、それはDecimalにブリッジされます；NSDecimal Numberをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合は使ってください。

source: An object for which to search in the array.
ja: この配列の中で捜すことになるあるオブジェクト。

source: An object isn’t ready to be used until it has been initialized.
ja: オブジェクトは、それが初期化されてしまうまで使われる準備ができていません。

source: An object might encode itself into an archive, but encode a proxy for itself if it’s being encoded for distribution.
ja: オブジェクトは、それ自身をアーカイブへとエンコードします、しかしそれが供給のためにエンコードされるならば、それ自身の代理をエンコードします。

source: An object of the class to Class representing the value specified by value.
ja: クラスto Classのオブジェクト、valueによって指定される値を表しています。

source: An object or objects to be copied.
ja: コピーされるオブジェクトまたは複数のオブジェクト。

source: An object registering as an observer.
ja: オブザーバとして登録するオブジェクト。

source: An object representing a dynamic collection of key-value pairs, for use instead of a Dictionary variable in cases that require reference semantics.
ja: キー値ペアからなる動的なコレクションを表しているオブジェクト、参照意味論を必要とする場合にDictionary変数の代わりに使うため。

source: An object representing a dynamic ordered collection, for use instead of an Array variable in cases that require reference semantics.
ja: 静的な順序付きコレクションを表しているオブジェクト、参照意味論を必要とする場合にArray変数の代わりに使うため。
